{
  "name": "APIGatewayMethodIntegration",
  "description": "Integration is a property of the AWS::ApiGateway::Method resource that specifies information about the target back end that an Amazon API Gateway (API Gateway) method calls.",
  "properties": [
    {
      "name": "CacheKeyParameters",
      "description": "A list of request parameters whose values API Gateway will cache.",
      "typeDescription": "List of strings",
      "required": false,
      "type": "string[]"
    },
    {
      "name": "CacheNamespace",
      "description": "An API-specific tag group of related cached parameters.",
      "typeDescription": "String",
      "required": false,
      "type": "String"
    },
    {
      "name": "Credentials",
      "description": "The credentials required for the integration. To specify an AWS Identity and Access Management (IAM) role that API Gateway assumes, specify the role's Amazon Resource Name (ARN). To use resource-based permissions on the AWS Lambda (Lambda) function, specify null. To require that the caller's identity be passed through from the request, specify arn:aws:iam::\\*:user/\\*.",
      "typeDescription": "String",
      "required": false,
      "type": "String"
    },
    {
      "name": "IntegrationHttpMethod",
      "description": "The integration's HTTP method type.",
      "typeDescription": "String",
      "required": false,
      "type": "String"
    },
    {
      "name": "IntegrationResponses",
      "description": "The response that API Gateway provides after a method's back end completes processing a request. API Gateway intercepts the back end's response so that you can control how API Gateway surfaces back-end responses. For example, you can map the back-end status codes to codes that you define.",
      "typeDescription": "List of Amazon API Gateway Method Integration IntegrationResponse",
      "required": false,
      "type": "APIGatewayMethodIntegrationIntegrationResponse[]"
    },
    {
      "name": "RequestParameters",
      "description": "The request parameters that API Gateway sends with the back-end request. Specify request parameters as key-value pairs (string-to-string maps), with a destination as the key and a source as the value.",
      "typeDescription": "List of key-value pairs",
      "required": false,
      "type": "key[]"
    },
    {
      "name": "RequestTemplates",
      "description": "The templates used to transform the method request body. Specify templates as key-value pairs (string-to-string maps), with a content type as the key and a template as the value.",
      "typeDescription": "List of key-value pairs",
      "required": false,
      "type": "key[]"
    },
    {
      "name": "Type",
      "description": "The type of back end your method is running, such as HTTP, AWS, or MOCK.",
      "typeDescription": "String",
      "required": false,
      "type": "String"
    },
    {
      "name": "Uri",
      "description": "The integration's Uniform Resource Identifier (URI). If you specify HTTP for the Type property, specify the API endpoint URL. If you specify MOCK for the Type property, don't specify this property. If you specify AWS for the Type property, specify an AWS service that follows the form: arn:aws:apigateway:region:subdomain.service|service:path|action/service_api. For example, a Lambda function URI follows the form: arn:aws:apigateway:region:lambda:path/path. The path is usually in the form /2015-03-31/functions/LambdaFunctionARN/invocations. For more information, see the uri property of the Integration resource in the Amazon API Gateway REST API Reference.",
      "typeDescription": "String",
      "required": false,
      "type": "String"
    }
  ],
  "referenceUrl": "http://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-apitgateway-method-integration.html"
}