{
  "name": "EC2ContainerServiceTaskDefinitionContainerDefinitions",
  "description": "ContainerDefinitions is a property of the AWS::ECS::TaskDefinition resource that describes the configuration of a container. The container definitions are passed to the Docker daemon.",
  "properties": [
    {
      "name": "Command",
      "description": "The CMD value to pass to the container. For more information about the Docker CMD parameter, see https://docs.docker.com/reference/builder/#cmd.",
      "required": false,
      "type": "string[]"
    },
    {
      "name": "Cpu",
      "description": "The minimum number of CPU units to reserve for the container. Containers share unallocated CPU units with other containers on the instance by using the same ratio as their allocated CPU units.",
      "required": false,
      "type": "Number"
    },
    {
      "name": "EntryPoint",
      "description": "The ENTRYPOINT value to pass to the container. For more information about the Docker ENTRYPOINT parameter, see https://docs.docker.com/reference/builder/#entrypoint.",
      "required": false,
      "type": "string[]"
    },
    {
      "name": "Environment",
      "description": "The environment variables to pass to the container.",
      "required": false,
      "type": "EC2ContainerServiceTaskDefinitionContainerDefinitionsEnvironment[]"
    },
    {
      "name": "Essential",
      "description": "Indicates whether the task stops if this container fails. If you specify true and the container fails, all other containers in the task stop. If you specify false and the container fails, none of the other containers in the task are affected. This value is true by default.",
      "required": false,
      "type": "Boolean"
    },
    {
      "name": "Image",
      "description": "The image to use for a container, which is passed directly to the Docker daemon. You can use images in the Docker Hub registry or specify other repositories (repository-url/image:tag).",
      "required": true,
      "type": "String"
    },
    {
      "name": "Links",
      "description": "The name of another container to connect to. With links, containers can communicate with each other without using port mappings.",
      "required": false,
      "type": "string[]"
    },
    {
      "name": "Memory",
      "description": "The number of MiB of memory to reserve for the container. If your container attempts to exceed the allocated memory, the container is killed.",
      "required": true,
      "type": "Number"
    },
    {
      "name": "MountPoints",
      "description": "The mount points for data volumes in the container.",
      "required": false,
      "type": "EC2ContainerServiceTaskDefinitionContainerDefinitionsMountPoint[]"
    },
    {
      "name": "Name",
      "description": "A name for the container.",
      "required": true,
      "type": "String"
    },
    {
      "name": "PortMappings",
      "description": "A mapping of the container port to a host port. Port mappings enable containers to access ports on the host container instance to send or receive traffic.",
      "required": false,
      "type": "EC2ContainerServiceTaskDefinitionContainerDefinitionsPortMapping[]"
    },
    {
      "name": "VolumesFrom",
      "description": "Data volumes to mount from another container.",
      "required": false,
      "type": "EC2ContainerServiceTaskDefinitionContainerDefinitionsVolumesFrom[]"
    }
  ],
  "referenceUrl": "http://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-properties-ecs-taskdefinition-containerdefinitions.html"
}