{
  "fullName": "AWS::Route53::RecordSet",
  "namespace": "AWS",
  "category": "Route53",
  "name": "RecordSet",
  "shortDesc": "The AWS::Route53::RecordSet type can be used as a standalone resource or as an embedded property in the AWS::Route53::RecordSetGroup type. Note that some AWS::Route53::RecordSet properties are valid only when used within AWS::Route53::RecordSetGroup.",
  "properties": [
    {
      "name": "AliasTarget",
      "desc": "Alias resource record sets only: Information about the domain to which you are redirecting traffic.",
      "required": false,
      "type": "AliasTarget",
      "update": "No interruption"
    },
    {
      "name": "Comment",
      "desc": "Any comments that you want to include about the hosted zone.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Failover",
      "desc": "Designates the record set as a PRIMARY or SECONDARY failover record set. When you have more than one resource performing the same function, you can configure Amazon Route 53 to check the health of your resources and use only health resources to respond to DNS queries. You cannot create nonfailover resource record sets that have the same Name and Type property values as failover resource record sets. For more information, see the Failover element in the Amazon Route 53 API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "GeoLocation",
      "desc": "Describes how Amazon Route 53 responds to DNS queries based on the geographic origin of the query.",
      "required": false,
      "type": "Amazon Route 53 Record Set GeoLocation Property",
      "update": "No interruption"
    },
    {
      "name": "HealthCheckId",
      "desc": "The health check ID that you want to apply to this record set. Amazon Route 53 returns this resource record set in response to a DNS query only while record set is healthy.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "HostedZoneId",
      "desc": "The ID of the hosted zone.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "HostedZoneName",
      "desc": "The name of the domain for the hosted zone where you want to add the record set.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Name",
      "desc": "The name of the domain. You must specify a fully qualified domain name that ends with a period as the last label indication. If you omit the final period, AWS CloudFormation adds it.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Region",
      "desc": "Latency resource record sets only: The Amazon EC2 region where the resource that is specified in this resource record set resides. The resource typically is an AWS resource, for example, Amazon EC2 instance or an Elastic Load Balancing load balancer, and is referred to by an IP address or a DNS domain name, depending on the record type.",
      "required": false
    },
    {
      "name": "ResourceRecords",
      "desc": "List of resource records to add. Each record should be in the format appropriate for the record type specified by the Type property. For information about different record types and their record formats, see Appendix: Domain Name Format in the Amazon Route 53 Developer Guide.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption"
    },
    {
      "name": "SetIdentifier",
      "desc": "A unique identifier that differentiates among multiple resource record sets that have the same combination of DNS name and type.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "TTL",
      "desc": "The resource record cache time to live (TTL), in seconds. If you specify this property, do not specify the AliasTarget property. For alias target records, the alias uses a TTL value from the target.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Type",
      "desc": "The type of records to add.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Weight",
      "desc": "Weighted resource record sets only: Among resource record sets that have the same combination of DNS name and type, a value that determines what portion of traffic for the current resource record set is routed to the associated location.",
      "required": false,
      "type": "Number. Weight expects integer values.",
      "update": "No interruption"
    }
  ],
  "attributes": []
}