{
  "fullName": "AWS::OpsWorks::Stack",
  "namespace": "AWS",
  "category": "OpsWorks",
  "name": "Stack",
  "shortDesc": "Creates an AWS OpsWorks stack. An AWS OpsWorks stack represents a set of instances that you want to manage collectively, typically because they have a common purpose such as serving PHP applications.",
  "properties": [
    {
      "name": "AgentVersion",
      "desc": "The AWS OpsWorks agent version that you want to use. The agent communicates with the service and handles tasks such as initiating Chef runs in response to lifecycle events. For valid values, see the AgentVersion parameter for the CreateStack action in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Attributes",
      "desc": "One or more user-defined key-value pairs to be added to the stack attributes bag.",
      "required": false,
      "type": "A list of key-value pairs",
      "update": "No interruption"
    },
    {
      "name": "ChefConfiguration",
      "desc": "Describes the Chef configuration. For more information, see the CreateStack ChefConfiguration parameter in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "AWS OpsWorks ChefConfiguration Type",
      "update": "No interruption"
    },
    {
      "name": "ConfigurationManager",
      "desc": "Describes the configuration manager. When you create a stack, you use the configuration manager to specify the Chef version. For supported Chef versions, see the CreateStack ConfigurationManager parameter in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "AWS OpsWorks StackConfigurationManager Type",
      "update": "No interruption"
    },
    {
      "name": "CustomCookbooksSource",
      "desc": "Contains the information required to retrieve a cookbook from a repository.",
      "required": false,
      "type": "AWS OpsWorks Source Type",
      "update": "No interruption"
    },
    {
      "name": "CustomJson",
      "desc": "A user-defined custom JSON object. The custom JSON is used to override the corresponding default stack configuration JSON values. For more information, see CreateStack in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "JSON object",
      "update": "No interruption"
    },
    {
      "name": "DefaultAvailabilityZone",
      "desc": "The stack's default Availability Zone, which must be in the specified region.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "DefaultInstanceProfileArn",
      "desc": "The Amazon Resource Name (ARN) of an IAM instance profile that is the default profile for all of the stack's Amazon EC2 instances.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "DefaultOs",
      "desc": "The stack's default operating system. For more information, see CreateStack in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "DefaultRootDeviceType",
      "desc": "The default root device type. This value is used by default for all instances in the stack, but you can override it when you create an instance. For more information, see CreateStack in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "DefaultSshKeyName",
      "desc": "A default SSH key for the stack instances. You can override this value when you create or update an instance.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "DefaultSubnetId",
      "desc": "The stack's default subnet ID. All instances are launched into this subnet unless you specify another subnet ID when you create the instance.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "HostnameTheme",
      "desc": "The stack's host name theme, with spaces replaced by underscores. The theme is used to generate host names for the stack's instances. For more information, see CreateStack in the AWS OpsWorks API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Name",
      "desc": "The name of the AWS OpsWorks stack.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "ServiceRoleArn",
      "desc": "The AWS Identity and Access Management (IAM) role that AWS OpsWorks uses to work with AWS resources on your behalf. You must specify an Amazon Resource Name (ARN) for an existing IAM role.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "UseCustomCookbooks",
      "desc": "Whether the stack uses custom cookbooks.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "UseOpsworksSecurityGroups",
      "desc": "Whether to associate the AWS OpsWorks built-in security groups with the stack's layers.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "VpcId",
      "desc": "The ID of the VPC that the stack is to be launched into, which must be in the specified region. All instances are launched into this VPC. If you specify this property, you must specify the DefaultSubnetId property.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    }
  ],
  "attributes": []
}