{
  "fullName": "AWS::WorkSpaces::Workspace",
  "namespace": "AWS",
  "category": "WorkSpaces",
  "name": "Workspace",
  "shortDesc": "The AWS::WorkSpaces::Workspace resource creates an Amazon WorkSpaces workspace, which is a cloud-based desktop experience for end users. For more information, see the Amazon WorkSpaces Administration Guide.",
  "properties": [
    {
      "name": "BundleId",
      "desc": "The identifier of the bundle from which you want to create the workspace. A bundle specifies the details of the workspace, such as the installed applications and the size of CPU, memory, and storage. Use the DescribeWorkspaceBundles action to list the bundles that AWS offers.",
      "required": true,
      "type": "String",
      "update": "Updates are not supported.. To update this property, you must also update another property that triggers a replacement, such as the UserName property."
    },
    {
      "name": "DirectoryId",
      "desc": "The identifier of the AWS Directory Service directory in which you want to create the workspace. The directory must already be registered with Amazon WorkSpaces. Use the DescribeWorkspaceDirectories action to list the directories that are available.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "UserName",
      "desc": "The name of the user to which the workspace is assigned. This user name must exist in the specified AWS Directory Service directory.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "RootVolumeEncryptionEnabled",
      "desc": "Indicates whether Amazon WorkSpaces encrypts data stored on the root volume (C: drive).",
      "required": false,
      "type": "Boolean",
      "update": "Updates are not supported.. To update this property, you must also update another property that triggers a replacement, such as the UserName property."
    },
    {
      "name": "UserVolumeEncryptionEnabled",
      "desc": "Indicates whether Amazon WorkSpaces encrypts data stored on the user volume (D: drive).",
      "required": false,
      "type": "Boolean",
      "update": "Updates are not supported.. To update this property, you must also update another property that triggers a replacement, such as the UserName property."
    },
    {
      "name": "VolumeEncryptionKey",
      "desc": "The AWS Key Management Service (AWS KMS) key ID that Amazon WorkSpaces uses to encrypt data stored on your workspace.",
      "required": false,
      "type": "String",
      "update": "Updates are not supported.. To update this property, you must also update another property that triggers a replacement, such as the UserName property."
    }
  ],
  "attributes": []
}