{
  "fullName": "AWS::CloudWatch::Alarm",
  "namespace": "AWS",
  "category": "CloudWatch",
  "name": "Alarm",
  "shortDesc": "The AWS::CloudWatch::Alarm type creates an CloudWatch alarm.",
  "properties": [
    {
      "name": "ActionsEnabled",
      "desc": "Indicates whether or not actions should be executed during any changes to the alarm's state.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "AlarmActions",
      "desc": "The list of actions to execute when this alarm transitions into an ALARM state from any other state. Each action is specified as an Amazon Resource Number (ARN). For more information about creating alarms and the actions you can specify, see Creating Amazon CloudWatch Alarms in the Amazon CloudWatch Developer Guide.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption"
    },
    {
      "name": "AlarmDescription",
      "desc": "The description for the alarm.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "AlarmName",
      "desc": "A name for the alarm. If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the alarm name. For more information, see Name Type.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "ComparisonOperator",
      "desc": "The arithmetic operation to use when comparing the specified Statistic and Threshold. The specified Statistic value is used as the first operand.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Dimensions",
      "desc": "The dimensions for the alarm's associated metric.",
      "required": false,
      "type": "List of Metric Dimension",
      "update": "No interruption"
    },
    {
      "name": "EvaluationPeriods",
      "desc": "The number of periods over which data is compared to the specified threshold.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "InsufficientDataActions",
      "desc": "The list of actions to execute when this alarm transitions into an INSUFFICIENT_DATA state from any other state. Each action is specified as an Amazon Resource Number (ARN). Currently the only action supported is publishing to an Amazon SNS topic or an Amazon Auto Scaling policy.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption"
    },
    {
      "name": "MetricName",
      "desc": "The name for the alarm's associated metric. For more information about the metrics that you can specify, see Amazon CloudWatch Namespaces, Dimensions, and Metrics Reference in the Amazon CloudWatch Developer Guide.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Namespace",
      "desc": "The namespace for the alarm's associated metric.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "OKActions",
      "desc": "The list of actions to execute when this alarm transitions into an OK state from any other state. Each action is specified as an Amazon Resource Number (ARN). Currently the only action supported is publishing to an Amazon SNS topic or an Amazon Auto Scaling policy.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption"
    },
    {
      "name": "Period",
      "desc": "The time over which the specified statistic is applied. You must specify a time in seconds that is also a multiple of 60.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Statistic",
      "desc": "The statistic to apply to the alarm's associated metric.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Threshold",
      "desc": "The value against which the specified statistic is compared.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Unit",
      "desc": "The unit for the alarm's associated metric.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    }
  ],
  "attributes": []
}