{
  "fullName": "AWS::RDS::EventSubscription",
  "namespace": "AWS",
  "category": "RDS",
  "name": "EventSubscription",
  "shortDesc": "Use the AWS::RDS::EventSubscription resource to get notifications for Amazon Relational Database Service events through the Amazon Simple Notification Service. For more information, see Using Amazon RDS Event Notification in the Amazon Relational Database Service User Guide.",
  "properties": [
    {
      "name": "Enabled",
      "desc": "Indicates whether to activate the subscription. If you don't specify this property, AWS CloudFormation activates the subscription.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "EventCategories",
      "desc": "A list of event categories that you want to subscribe to for a given source type. If you don't specify this property, you are notified about all event categories.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption"
    },
    {
      "name": "SnsTopicArn",
      "desc": "The Amazon Resource Name (ARN) of an Amazon SNS topic that you want to send event notifications to.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "SourceIds",
      "desc": "A list of identifiers for which Amazon RDS provides notification events.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption"
    },
    {
      "name": "SourceType",
      "desc": "The type of source for which Amazon RDS provides notification events. For example, if you want to be notified of events generated by a database instance, set this parameter to db-instance. If you don't specify a value, notifications are provided for all source types.",
      "required": false,
      "type": "String",
      "update": "Replacement if you're removing this property after it was previously specified. All other updates require no interruption."
    }
  ],
  "attributes": []
}