{
  "fullName": "AWS::GameLift::Fleet",
  "namespace": "AWS",
  "category": "GameLift",
  "name": "Fleet",
  "shortDesc": "The AWS::GameLift::Fleet resource creates an Amazon GameLift (GameLift) fleet to host game servers. A fleet is a set of EC2 instances, each of which is a host in the fleet. For more information, see the CreateFleet action in the Amazon GameLift API Reference.",
  "properties": [
    {
      "name": "BuildId",
      "desc": "The unique identifier for the build that you want to use with this fleet.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Description",
      "desc": "Information that helps you identify the purpose of this fleet.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "DesiredEC2Instances",
      "desc": "The number of EC2 instances that you want in this fleet.",
      "required": true,
      "type": "Integer",
      "update": "No interruption"
    },
    {
      "name": "EC2InboundPermissions",
      "desc": "The incoming traffic, expressed as IP ranges and port numbers, that is permitted to access the game server. If you don't specify values, no traffic is permitted to your game servers.",
      "required": false,
      "type": "List of Amazon GameLift Fleet EC2InboundPermission",
      "update": "No interruption"
    },
    {
      "name": "EC2InstanceType",
      "desc": "The type of EC2 instances that the fleet uses. EC2 instance types define the CPU, memory, storage, and networking capacity of the fleet's hosts. For more information about the instance types that are supported by GameLift, see the EC2InstanceType parameter in the Amazon GameLift API Reference.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "LogPaths",
      "desc": "The path to game-session log files that are generated by your game server, with the slashes (\\) escaped. After a game session has been terminated, GameLift captures and stores the logs in an S3 bucket.",
      "required": false,
      "type": "List of strings",
      "update": "Replacement"
    },
    {
      "name": "Name",
      "desc": "An identifier to associate with this fleet. Fleet names don't need to be unique.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "ServerLaunchParameters",
      "desc": "The parameters that are required to launch your game server. Specify these parameters as a string of command-line parameters, such as +sv_port 33435 +start_lobby.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "ServerLaunchPath",
      "desc": "The location of your game server that GameLift launches. You must escape the slashes (\\) and use the following pattern: C:\\\\game\\\\launchpath. For example, if your game server files are in the MyGame folder, the path should be C:\\\\game\\\\MyGame\\\\server.exe.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    }
  ],
  "attributes": []
}