{
  "fullName": "AWS::DirectoryService::MicrosoftAD",
  "namespace": "AWS",
  "category": "DirectoryService",
  "name": "MicrosoftAD",
  "shortDesc": "The AWS::DirectoryService::MicrosoftAD resource creates a Microsoft Active Directory in AWS so that your directory users and groups can access the AWS Management Console and AWS applications using their existing credentials. For more information, see What Is AWS Directory Service? in the AWS Directory Service Administration Guide.",
  "properties": [
    {
      "name": "CreateAlias",
      "desc": "A unique alias to assign to the Microsoft Active Directory in AWS. AWS Directory Service uses the alias to construct the access URL for the directory, such as http://alias.awsapps.com. By default, AWS CloudFormation does not create an alias.",
      "required": false,
      "type": "Boolean",
      "update": "Replacement"
    },
    {
      "name": "EnableSso",
      "desc": "Whether to enable single sign-on for a Microsoft Active Directory in AWS. Single sign-on allows users in your directory to access certain AWS services from a computer joined to the directory without having to enter their credentials separately. If you don't specify a value, AWS CloudFormation disables single sign-on by default.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "Name",
      "desc": "The fully qualified name for the Microsoft Active Directory in AWS, such as corp.example.com. The name doesn't need to be publicly resolvable; it will resolve inside your VPC only.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Password",
      "desc": "The password for the default administrative user, Admin.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "ShortName",
      "desc": "The NetBIOS name for your domain, such as CORP. If you don't specify a value, AWS Directory Service uses the first part of your directory DNS server name. For example, if your directory DNS server name is corp.example.com, AWS Directory Service specifies CORP for the NetBIOS name.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "VpcSettings",
      "desc": "Specifies the VPC settings of the Microsoft Active Directory server in AWS.",
      "required": true,
      "type": "AWS Directory Service MicrosoftAD VpcSettings",
      "update": "Replacement"
    }
  ],
  "attributes": [
    {
      "name": "Alias",
      "desc": "The alias for a directory. For example: d-12373a053a or alias4-mydirectory-12345abcgmzsk (if you have the CreateAlias property set to true)."
    },
    {
      "name": "DnsIpAddresses",
      "desc": "The IP addresses of the DNS servers for the directory, such as [ \"192.0.2.1\", \"192.0.2.2\" ]."
    }
  ]
}