{
  "fullName": "AWS::EC2::Instance",
  "namespace": "AWS",
  "category": "EC2",
  "name": "Instance",
  "shortDesc": "The AWS::EC2::Instance type creates an Amazon EC2 instance.",
  "properties": [
    {
      "name": "AvailabilityZone",
      "desc": "Specifies the name of the Availability Zone in which the instance is located.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "BlockDeviceMappings",
      "desc": "Defines a set of Amazon Elastic Block Store block device mappings, ephemeral instance store block device mappings, or both. For more information, see Amazon Elastic Block Store or Amazon EC2 Instance Store in the Amazon EC2 User Guide for Linux Instances.",
      "required": false,
      "type": "A list of Amazon EC2 Block Device Mapping Property.",
      "update": "Replacement. If you change only the DeleteOnTermination property for one or more block devices, update requires No interruption."
    },
    {
      "name": "DisableApiTermination",
      "desc": "Specifies whether the instance can be terminated through the API.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "EbsOptimized",
      "desc": "Specifies whether the instance is optimized for Amazon Elastic Block Store I/O. This optimization provides dedicated throughput to Amazon EBS and an optimized configuration stack to provide optimal EBS I/O performance.",
      "required": false,
      "type": "Boolean",
      "update": "Some interruptions for Amazon EBS-backed instances"
    },
    {
      "name": "IamInstanceProfile",
      "desc": "The physical ID (resource name) of an instance profile or a reference to an AWS::IAM::InstanceProfile resource.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "ImageId",
      "desc": "Provides the unique ID of the Amazon Machine Image (AMI) that was assigned during registration.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "InstanceInitiatedShutdownBehavior",
      "desc": "Indicates whether an instance stops or terminates when you shut down the instance from the instance's operating system shutdown command. You can specify stop or terminate. For more information, see the RunInstances command in the Amazon EC2 API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "InstanceType",
      "desc": "The instance type, such as t2.micro. The default type is \"m1.small\". For a list of instance types, see Instance Families and Types.",
      "required": false,
      "type": "String",
      "update": "Some interruptions for Amazon EBS-backed instances"
    },
    {
      "name": "KernelId",
      "desc": "The kernel ID.",
      "required": false,
      "type": "String",
      "update": "Some interruptions for Amazon EBS-backed instances"
    },
    {
      "name": "KeyName",
      "desc": "Provides the name of the Amazon EC2 key pair.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Monitoring",
      "desc": "Specifies whether monitoring is enabled for the instance.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "NetworkInterfaces",
      "desc": "A list of embedded objects that describe the network interfaces to associate with this instance.",
      "required": false,
      "type": "A list of EC2 NetworkInterface Embedded Property Type",
      "update": "Replacement"
    },
    {
      "name": "PlacementGroupName",
      "desc": "The name of an existing placement group that you want to launch the instance into (for cluster instances).",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "PrivateIpAddress",
      "desc": "The private IP address for this instance.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "RamdiskId",
      "desc": "The ID of the RAM disk to select. Some kernels require additional drivers at launch. Check the kernel requirements for information about whether you need to specify a RAM disk. To find kernel requirements, go to the AWS Resource Center and search for the kernel ID.",
      "required": false,
      "type": "String",
      "update": "Some interruptions for Amazon EBS-backed instances"
    },
    {
      "name": "SecurityGroupIds",
      "desc": "A list that contains the security group IDs for VPC security groups to assign to the Amazon EC2 instance. If you specified the NetworkInterfaces property, do not specify this property.",
      "required": false,
      "type": "List of strings",
      "update": "No interruption for instances that are in a VPC."
    },
    {
      "name": "SecurityGroups",
      "desc": "Valid only for Amazon EC2 security groups. A list that contains the Amazon EC2 security groups to assign to the Amazon EC2 instance. The list can contain both the name of existing Amazon EC2 security groups or references to AWS::EC2::SecurityGroup resources created in the template.",
      "required": false,
      "type": "List of strings",
      "update": "Replacement."
    },
    {
      "name": "SourceDestCheck",
      "desc": "Controls whether source/destination checking is enabled on the instance. Also determines if an instance in a VPC will perform network address translation (NAT).",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "SsmAssociations",
      "desc": "The Amazon EC2 Simple Systems Manager (SSM) document and parameter values to associate with this instance. To use this property, you must specify an IAM role for the instance. For more information, see Prerequisites for Remotely Running Commands on EC2 Instances in the Amazon EC2 User Guide for Microsoft Windows Instances.",
      "required": false,
      "type": "List of Amazon EC2 Instance SsmAssociations.",
      "update": "No interruption"
    },
    {
      "name": "SubnetId",
      "desc": "If you're using Amazon VPC, this property specifies the ID of the subnet that you want to launch the instance into. If you specified the NetworkInterfaces property, do not specify this property.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Tags",
      "desc": "An arbitrary set of tags (key–value pairs) for this instance.",
      "required": false,
      "type": "AWS CloudFormation Resource Tags",
      "update": "No interruption."
    },
    {
      "name": "Tenancy",
      "desc": "The tenancy of the instance that you want to launch. This value can be either \"default\" or \"dedicated\". An instance that has a tenancy value of \"dedicated\" runs on single-tenant hardware and can be launched only into a VPC. For more information, see Using EC2 Dedicated Instances Within Your VPC in the Amazon VPC User Guide.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "UserData",
      "desc": "Base64-encoded MIME user data that is made available to the instances.",
      "required": false,
      "type": "String",
      "update": "Some interruptions for Amazon EBS-backed instances."
    },
    {
      "name": "Volumes",
      "desc": "The Amazon EBS volumes to attach to the instance.",
      "required": false,
      "type": "A list of EC2 MountPoints.",
      "update": "No interruption"
    },
    {
      "name": "AdditionalInfo",
      "desc": "Reserved.",
      "required": false,
      "type": "String",
      "update": "Some interruptions for Amazon EBS-backed instances"
    }
  ],
  "attributes": [
    {
      "name": "AvailabilityZone",
      "desc": "The Availability Zone where the specified instance is launched. For example: us-east-1b.You can retrieve a list of all Availability Zones for a region by using the Fn::GetAZs intrinsic function."
    },
    {
      "name": "PrivateDnsName",
      "desc": "The private DNS name of the specified instance. For example: ip-10-24-34-0.ec2.internal."
    },
    {
      "name": "PublicDnsName",
      "desc": "The public DNS name of the specified instance. For example: ec2-107-20-50-45.compute-1.amazonaws.com."
    },
    {
      "name": "PrivateIp",
      "desc": "The private IP address of the specified instance. For example: 10.24.34.0."
    },
    {
      "name": "PublicIp",
      "desc": "The public IP address of the specified instance. For example: 192.0.2.0."
    }
  ]
}