{
  "fullName": "AWS::EFS::MountTarget",
  "namespace": "AWS",
  "category": "EFS",
  "name": "MountTarget",
  "description": "The AWS::EFS::MountTarget resource creates a mount target for an Amazon Elastic File System (Amazon EFS) file system (AWS::EFS::FileSystem). Use the mount target to mount file systems on Amazon Elastic Compute Cloud (Amazon EC2) instances. For more information, see the CreateMountTarget API in the Amazon Elastic File System User Guide.",
  "properties": [
    {
      "name": "FileSystemId",
      "description": "The ID of the file system for which you want to create the mount target.",
      "typeDescription": "String",
      "required": true,
      "type": "String",
      "update": "Replacement. Before updating this property, stop EC2 instances that are using this mount target, and then restart them after the update is complete. This allows the instances to unmount the file system before the mount target is replaced. If you don't stop and restart them, instances or applications that are using those mounts might be disrupted when the mount target is deleted (uncommitted writes might be lost)."
    },
    {
      "name": "IpAddress",
      "description": "An IPv4 address that is within the address range of the subnet that is specified in the SubnetId property. If you don't specify an IP address, Amazon EFS automatically assigns an address that is within the range of the subnet.",
      "typeDescription": "String",
      "required": false,
      "type": "String",
      "update": "Replacement. Before updating this property, stop EC2 instances that are using this mount target, and then restart them after the update is complete. This allows the instances to unmount the file system before the mount target is replaced. If you don't stop and restart them, instances or applications that are using those mounts might be disrupted when the mount target is deleted (uncommitted writes might be lost)."
    },
    {
      "name": "SecurityGroups",
      "description": "A maximum of five VPC security group IDs that are in the same VPC as the subnet that is specified in the SubnetId property. For more information about security groups and mount targets, see Security in the Amazon Elastic File System User Guide.",
      "typeDescription": "List of strings",
      "required": true,
      "type": "String[]",
      "update": "No interruption"
    },
    {
      "name": "SubnetId",
      "description": "The ID of the subnet in which you want to add the mount target.",
      "typeDescription": "String",
      "required": true,
      "type": "String",
      "update": "Replacement. Before updating this property, stop EC2 instances that are using this mount target and then restart them after the update is complete. That way the instances can unmount the file system before the mount target is replaced. If you don't stop and restart them, instances or applications that are using those mounts might be disrupted when the mount target is deleted (uncommitted writes might be lost)."
    }
  ],
  "attributes": [],
  "referenceUrl": "http://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-resource-efs-mounttarget.html"
}