{
  "fullName": "AWS::ElastiCache::ReplicationGroup",
  "namespace": "AWS",
  "category": "ElastiCache",
  "name": "ReplicationGroup",
  "description": "The AWS::ElastiCache::ReplicationGroup resource creates an Amazon ElastiCache replication group. A replication group is a collection of cache clusters, where one of the clusters is a primary read-write cluster and the others are read-only replicas.",
  "properties": [
    {
      "name": "AutomaticFailoverEnabled",
      "description": "Indicates whether Multi-AZ is enabled. When Multi-AZ is enabled, a read-only replica is automatically promoted to a read-write primary cluster if the existing primary cluster fails. If you specify true, you must specify a value greater than 1 for the NumCacheNodes property. By default, AWS CloudFormation sets the value to true.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "AutoMinorVersionUpgrade",
      "description": "Currently, this property isn't used by ElastiCache.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "CacheNodeType",
      "description": "The compute and memory capacity of nodes in the node group. To see valid values, see CreateReplicationGroup in the Amazon ElastiCache API Reference Guide.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "CacheParameterGroupName",
      "description": "The name of the parameter group to associate with this replication group.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "CacheSecurityGroupNames",
      "description": "A list of cache security group names to associate with this replication group. If you specify the SecurityGroupIds property, do not specify this property; you can specify only one.",
      "required": false,
      "type": "string[]",
      "update": "No interruption"
    },
    {
      "name": "CacheSubnetGroupName",
      "description": "The name of a cache subnet group to use for this replication group.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Engine",
      "description": "The name of the cache engine to use for the cache clusters in this replication group. Currently, you can specify only redis.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "EngineVersion",
      "description": "The version number of the cache engine to use for the cache clusters in this replication group.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "NotificationTopicArn",
      "description": "The Amazon Resource Name (ARN) of the Amazon Simple Notification Service topic to which notifications are sent.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "NumCacheClusters",
      "description": "The number of cache clusters for this replication group. If automatic failover is enabled, you must specify a value greater than 1.",
      "required": true,
      "type": "Number",
      "update": "Replacement"
    },
    {
      "name": "Port",
      "description": "The port number on which each member of the replication group accepts connections.",
      "required": false,
      "type": "Number",
      "update": "Replacement"
    },
    {
      "name": "PreferredCacheClusterAZs",
      "description": "A list of Availability Zones (AZs) in which the cache clusters in this replication group are created.",
      "required": false,
      "type": "string[]",
      "update": "Replacement"
    },
    {
      "name": "PreferredMaintenanceWindow",
      "description": "The weekly time range during which system maintenance can occur. Use the following format to specify a time range: ddd:hh24:mi-ddd:hh24:mi (24H Clock UTC). For example, you can specify sun:22:00-sun:23:30 for Sunday from 10 PM to 11:30 PM.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "ReplicationGroupDescription",
      "description": "The description of the replication group.",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "SecurityGroupIds",
      "description": "A list of Amazon Virtual Private Cloud (Amazon VPC) security groups to associate with this replication group. Use this property only when you are creating a replication group in a VPC. If you specify the CacheSecurityGroupNames property, do not specify this property; you can specify only one.",
      "required": false,
      "type": "string[]",
      "update": "No interruption"
    },
    {
      "name": "SnapshotArns",
      "description": "A single-element string list that specifies an ARN of a Redis .rdb snapshot file that is stored in Amazon Simple Storage Service (Amazon S3). The snapshot file populates the node group. The Amazon S3 object name in the ARN cannot contain commas. For example, you can specify arn:aws:s3:::my_bucket/snapshot1.rdb.",
      "required": false,
      "type": "string[]",
      "update": "Replacement"
    },
    {
      "name": "SnapshotRetentionLimit",
      "description": "The number of days that ElastiCache retains automatic snapshots before deleting them.",
      "required": false,
      "type": "Number",
      "update": "No interruption"
    },
    {
      "name": "SnapshotWindow",
      "description": "The time range (in UTC) when ElastiCache takes a daily snapshot of your node group. For example, you can specify 05:00-09:00.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    }
  ],
  "attributes": [
    {
      "name": "PrimaryEndPoint.Address",
      "description": "The DNS address of the primary read-write cache node."
    },
    {
      "name": "PrimaryEndPoint.Port",
      "description": "The number of the port that the primary read-write cache engine is listening on."
    },
    {
      "name": "ReadEndPoint.Addresses",
      "description": "A string with a list of endpoints for the read-only replicas. The order of the addresses map to the order of the ports from the ReadEndPoint.Ports attribute."
    },
    {
      "name": "ReadEndPoint.Ports",
      "description": "A string with a list of ports for the read-only replicas. The order of the ports map to the order of the addresses from the ReadEndPoint.Addresses attribute."
    },
    {
      "name": "ReadEndPoint.Addresses.List",
      "description": "A list of endpoints for the read-only replicas. The order of the addresses map to the order of the ports from the ReadEndPoint.Ports.List attribute."
    },
    {
      "name": "ReadEndPoint.Ports.List",
      "description": "A list of ports for the read-only replicas. The order of the ports map to the order of the addresses from the ReadEndPoint.Addresses.List attribute."
    }
  ],
  "referenceUrl": "http://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-resource-elasticache-replicationgroup.html"
}