{
  "fullName": "AWS::DataPipeline::Pipeline",
  "namespace": "AWS",
  "category": "DataPipeline",
  "name": "Pipeline",
  "description": "Creates a data pipeline that you can use to automate the movement and transformation of data. In each pipeline, you define pipeline objects, such as activities, schedules, data nodes, and resources. For information about pipeline objects and components that you can use, see Pipeline Object Reference in the AWS Data Pipeline Developer Guide.",
  "properties": [
    {
      "name": "Activate",
      "description": "Indicates whether to validate and start the pipeline or stop an active pipeline. By default, the value is set to true.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "Description",
      "description": "A description for the pipeline.",
      "required": false,
      "type": "String",
      "update": "Replacement."
    },
    {
      "name": "Name",
      "description": "A name for the pipeline. Because AWS CloudFormation assigns each new pipeline a unique identifier, you can use the same name for multiple pipelines that are associated with your AWS account.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "ParameterObjects",
      "description": "Defines the variables that are in the pipeline definition. For more information, see Creating a Pipeline Using Parameterized Templates in the AWS Data Pipeline Developer Guide.",
      "required": false,
      "type": "AWSDataPipelinePipelineParameterObjects",
      "update": "No interruption"
    },
    {
      "name": "ParameterValues",
      "description": "Defines the values for the parameters that are defined in the ParameterObjects property. For more information, see Creating a Pipeline Using Parameterized Templates in the AWS Data Pipeline Developer Guide.",
      "required": false,
      "type": "AWSDataPipelinePipelineParameterValues",
      "update": "No interruption"
    },
    {
      "name": "PipelineObjects",
      "description": "A list of pipeline objects that make up the pipeline. For more information about pipeline objects and a description of each object, see Pipeline Object Reference in the AWS Data Pipeline Developer Guide.",
      "required": true,
      "type": "AWSDataPipelinePipelineObject[]",
      "update": "Some interruptions. Not all objects, fields, and values can be updated. Restrictions on what can be updated are documented in Editing Your Pipelines in the AWS Data Pipeline Developer Guide."
    },
    {
      "name": "PipelineTags",
      "description": "A list of arbitrary tags (key-value pairs) to associate with the pipeline, which you can use to control permissions. For more information, see Controlling Access to Pipelines and Resources in the AWS Data Pipeline Developer Guide.",
      "required": false,
      "type": "AWSDataPipelinePipelinePipelineTags",
      "update": "No interruption"
    }
  ],
  "attributes": [],
  "referenceUrl": "http://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-resource-datapipeline-pipeline.html"
}