{
  "fullName": "AWS::CloudFormation::Stack",
  "namespace": "AWS",
  "category": "CloudFormation",
  "name": "Stack",
  "description": "The AWS::CloudFormation::Stack type nests a stack as a resource in a top-level template.",
  "properties": [
    {
      "name": "NotificationARNs",
      "description": "A list of existing Amazon SNS topics where notifications about stack events are sent.",
      "required": false,
      "type": "string[]",
      "update": "No interruption"
    },
    {
      "name": "Parameters",
      "description": "The set of parameters passed to AWS CloudFormation when this nested stack is created.",
      "required": false,
      "type": "CloudFormationStackParametersPropertyType",
      "update": "Whether an update causes interruptions depends on the resources that are being update. An update never causes a nested stack to be replaced."
    },
    {
      "name": "Tags",
      "description": "An arbitrary set of tags (key–value pairs) to describe this stack.",
      "required": false,
      "type": "AWSCloudFormationResourceTagsType[]",
      "update": "No interruption."
    },
    {
      "name": "TemplateURL",
      "description": "The URL of a template that specifies the stack that you want to create as a resource. The template must be stored on an Amazon S3 bucket, so the URL must have the form: https://s3.amazonaws.com/.../TemplateName.template",
      "required": true,
      "type": "String",
      "update": "Whether an update causes interruptions depends on the resources that are being update. An update never causes a nested stack to be replaced."
    },
    {
      "name": "TimeoutInMinutes",
      "description": "The length of time, in minutes, that AWS CloudFormation waits for the nested stack to reach the CREATE_COMPLETE state. The default is no timeout. When AWS CloudFormation detects that the nested stack has reached the CREATE_COMPLETE state, it marks the nested stack resource as CREATE_COMPLETE in the parent stack and resumes creating the parent stack. If the timeout period expires before the nested stack reaches CREATE_COMPLETE, AWS CloudFormation marks the nested stack as failed and rolls back both the nested stack and parent stack.",
      "required": false,
      "type": "String",
      "update": "Updates are not supported."
    }
  ],
  "attributes": [
    {
      "name": "Outputs.NestedStackOutputName",
      "description": "Returns: The output value from the specified nested stack where NestedStackOutputName is the name of the output value."
    }
  ]
}