{
  "fullName": "AWS::ElastiCache::CacheCluster",
  "namespace": "AWS",
  "category": "ElastiCache",
  "name": "CacheCluster",
  "description": "The AWS::ElastiCache::CacheCluster type creates an Amazon ElastiCache cache cluster.",
  "properties": [
    {
      "name": "AutoMinorVersionUpgrade",
      "description": "Indicates that minor engine upgrades will be applied automatically to the cache cluster during the maintenance window.",
      "required": false,
      "type": "Boolean",
      "update": "No interruption"
    },
    {
      "name": "AZMode",
      "description": "For Memcached cache clusters, indicates whether the nodes are created in a single Availability Zone or across multiple Availability Zones in the cluster's region. For valid values, see CreateCacheCluster in the Amazon ElastiCache API Reference.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "CacheNodeType",
      "description": "The compute and memory capacity of nodes in a cache cluster.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "CacheParameterGroupName",
      "description": "The name of the cache parameter group that is associated with this cache cluster.",
      "required": false,
      "type": "String",
      "update": "Some interruptions"
    },
    {
      "name": "CacheSecurityGroupNames",
      "description": "A list of cache security group names that are associated with this cache cluster. If your cache cluster is in a VPC, specify the VpcSecurityGroupIds property instead.",
      "required": false,
      "type": "string[]",
      "update": "No interruption"
    },
    {
      "name": "CacheSubnetGroupName",
      "description": "The cache subnet group that you associate with a cache cluster.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "ClusterName",
      "description": "A name for the cache cluster. If you don't specify a name, AWS CloudFormation generates a unique physical ID and uses that ID for the cache cluster. For more information, see Name Type.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Engine",
      "description": "The name of the cache engine to be used for this cache cluster, such as memcached or redis.",
      "required": true,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "EngineVersion",
      "description": "The version of the cache engine to be used for this cluster.",
      "required": false,
      "type": "String",
      "update": "Some interruptions"
    },
    {
      "name": "NotificationTopicArn",
      "description": "The Amazon Resource Name (ARN) of the Amazon Simple Notification Service (SNS) topic to which notifications will be sent.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "NumCacheNodes",
      "description": "The number of cache nodes that the cache cluster should have.",
      "required": true,
      "type": "String",
      "update": "No interruption. However, if the PreferredAvailabilityZone and PreferredAvailabilityZones properties were not previously specified and you don't specify any new values, an update requires replacement."
    },
    {
      "name": "Port",
      "description": "The port number on which each of the cache nodes will accept connections.",
      "required": false,
      "type": "Integer",
      "update": "Replacement"
    },
    {
      "name": "PreferredAvailabilityZone",
      "description": "The Amazon EC2 Availability Zone in which the cache cluster is created.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "PreferredAvailabilityZones",
      "description": "For Memcached cache clusters, the list of Availability Zones in which cache nodes are created. The number of Availability Zones listed must equal the number of cache nodes. For example, if you want to create three nodes in two different Availability Zones, you can specify [\"us-east-1a\", \"us-east-1a\", \"us-east-1b\"], which would create two nodes in us-east-1a and one node in us-east-1b.",
      "required": false,
      "type": "string[]"
    },
    {
      "name": "PreferredMaintenanceWindow",
      "description": "The weekly time range (in UTC) during which system maintenance can occur.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "SnapshotArns",
      "description": "The ARN of the snapshot file that you want to use to seed a new Redis cache cluster. If you manage a Redis instance outside of Amazon ElastiCache, you can create a new cache cluster in ElastiCache by using a snapshot file that is stored in an Amazon S3 bucket.",
      "required": false,
      "type": "string[]",
      "update": "Replacement"
    },
    {
      "name": "SnapshotName",
      "description": "The name of a snapshot from which to restore data into a new Redis cache cluster.",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "SnapshotRetentionLimit",
      "description": "For Redis cache clusters, the number of days for which ElastiCache retains automatic snapshots before deleting them. For example, if you set the value to 5, a snapshot that was taken today will be retained for 5 days before being deleted.",
      "required": false,
      "type": "Integer",
      "update": "No interruption"
    },
    {
      "name": "SnapshotWindow",
      "description": "For Redis cache clusters, the daily time range (in UTC) during which ElastiCache will begin taking a daily snapshot of your node group. For example, you can specify 05:00-09:00.",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Tags",
      "description": "An arbitrary set of tags (key–value pairs) for this cache cluster.",
      "required": false,
      "type": "AWSCloudFormationResourceTagsType[]",
      "update": "No interruption."
    },
    {
      "name": "VpcSecurityGroupIds",
      "description": "A list of VPC security group IDs. If your cache cluster isn't in a VPC, specify the CacheSecurityGroupNames property instead.",
      "required": false,
      "type": "string[]",
      "update": "No interruption"
    }
  ],
  "attributes": [
    {
      "name": "ConfigurationEndpoint.Address",
      "description": "The DNS address of the configuration endpoint for the Memcached cache cluster."
    },
    {
      "name": "ConfigurationEndpoint.Port",
      "description": "The port number of the configuration endpoint for the Memcached cache cluster."
    }
  ]
}