{
  "fullName": "AWS::ApiGateway::Authorizer",
  "namespace": "AWS",
  "category": "ApiGateway",
  "name": "Authorizer",
  "description": "The AWS::ApiGateway::Authorizer resource creates an authorization layer that Amazon API Gateway (API Gateway) activates for methods that have authorization enabled. API Gateway activates the authorizer when a client calls those methods.",
  "properties": [
    {
      "name": "AuthorizerCredentials",
      "description": "The credentials required for the authorizer. To specify an AWS Identity and Access Management (IAM) role that API Gateway assumes, specify the role's Amazon Resource Name (ARN). To use resource-based permissions on the AWS Lambda (Lambda) function, specify null.",
      "typeDescription": "String",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "AuthorizerResultTtlInSeconds",
      "description": "The time-to-live (TTL) period, in seconds, that specifies how long API Gateway caches authorizer results. If you specify a value greater than 0, API Gateway caches the authorizer responses. By default, API Gateway sets this property to 300. The maximum value is 3600, or 1 hour.",
      "typeDescription": "Integer",
      "required": false,
      "type": "Number",
      "update": "No interruption"
    },
    {
      "name": "AuthorizerUri",
      "description": "The authorizer's Uniform Resource Identifier (URI). If you specify TOKEN for the authorizer's Type property, specify a Lambda function URI, which has the form arn:aws:apigateway:region:lambda:path/path. The path usually has the form /2015-03-31/functions/LambdaFunctionARN/invocations.",
      "typeDescription": "String",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "IdentitySource",
      "description": "The source of the identity in an incoming request. If you specify TOKEN for the authorizer's Type property, specify a mapping expression. The custom header mapping expression has the form method.request.header.name, where name is the name of a custom authorization header that clients submit as part of their requests.",
      "typeDescription": "String",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "IdentityValidationExpression",
      "description": "A validation expression for the incoming identity. If you specify TOKEN for the authorizer's Type property, specify a regular expression. API Gateway uses the expression to attempt to match the incoming client token, and proceeds if the token matches. If the token doesn't match, API Gateway responds with a 401 (unauthorized request) error code.",
      "typeDescription": "String",
      "required": false,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "Name",
      "description": "The name of the authorizer.",
      "typeDescription": "String",
      "required": true,
      "type": "String",
      "update": "No interruption"
    },
    {
      "name": "RestApiId",
      "description": "The ID of the RestApi resource in which API Gateway creates the authorizer.",
      "typeDescription": "String",
      "required": false,
      "type": "String",
      "update": "Replacement"
    },
    {
      "name": "Type",
      "description": "The type of the authorizer, such as TOKEN.",
      "typeDescription": "String",
      "required": true,
      "type": "String",
      "update": "No interruption"
    }
  ],
  "attributes": [],
  "referenceUrl": "http://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/aws-resource-apigateway-authorizer.html"
}